Repository: Dindows-Systems/Skype-Examples
Catalog: SkypeTalking_0.9.6_SRC/SkypeTalking/src/locale/*/LC_MESSAGES/SkypeTalking.po
Languages: ar_eg

source: Application already running.
ar_eg: البرنامج يعمل حالياً بالفعل.

source: Error writing config file. The application may not be started. Please contact development team for help.
ar_eg: حدث خطأ في كتابة ملف التعريف أعاق البرنامج عن البدء. الرجاء الاتصال بفريق التطوير.

source: Error
ar_eg: خطأ

source: Could not set application language. The application may not be started. Please contact development team for help.
ar_eg: تعذر ضبط لغة البرنامج الأمر الذي قد يعوق عملية تشغيل البرنامج. الرجاء الاتصال بفريق التطوير.

source: Connecting to Skype...
ar_eg: يَجري الآن الدخول على skype...

source: Failed to initialize output subsystem. The application may not be started. Please contact development team for help.
ar_eg: تعذر تشغيل نظام الإخراج الفرعي، الأمر الذي قد يعوق عملية تشغيل البرنامج. الرجاء الاتصال بفريق التطوير.

source: Call from %s
ar_eg: مكالمة من %s

source: Calling %s
ar_eg: جاري الاتصال ب%s

source: Phone call from %s
ar_eg: مكالمة هاتفية من %s

source: Phone call to %s
ar_eg: مكالمة هاتفية ل%s

source: Call with %s finished, duration %s.
ar_eg: تم إنهاء المكالمة مع %s. مدة المكالمة: %s

source: Calling %s, routing...
ar_eg: skype: طلب مكالمة مع %s يتم التوجيه...

source: Sorry, call with %s failed
ar_eg: تعذر إتمام المكالمة مع %s

source: Call with %s in progress
ar_eg: مكالمتك مع %s جارية

source: Call with %s on hold
ar_eg: مكالمتك مع %s الآن في الانتظار

source: Missed call from %s
ar_eg: مكالمة لم يُرد عليها من %s

source: Call refused
ar_eg: تم رفْضُ المكالمة

source: Call with %s, busy
ar_eg: %s مشغول

source: Call with %s, cancelled
ar_eg: المكالمة مع %s أُلغِيَت

source: Call with %s on local hold
ar_eg: تم وضع المكالمة مع %sعلى الانتظار

source: Call with %s on remote hold
ar_eg: تم وضع المكالمة مع %s على الانتظار عن بعد.

source: Transferring call to %s
ar_eg: جاري تحويل المكالمة إلى %s

source: Call transferred to %s
ar_eg: تم تحويل المكالمة إلى %s

source: Reason unknown
ar_eg: السبب غير معروف

source: Misc error
ar_eg: خطأ غير معروف

source: User does not exist
ar_eg: هذا المستخدم لغير موجود

source: User is offline
ar_eg: المستخدم غير متصل

source: No Proxy found
ar_eg: لم يتم العثور على بروكسي

source: Session terminated
ar_eg: تم إنهاء العملية

source: No common codec
ar_eg: لا يوجد كوداك عام

source: Sound input/output error
ar_eg: خطأ في إحدى مدخلات أو مخرجات الصوت

source: Remote device error
ar_eg: خطأ في في الجهاز البعيد

source: You are blocked by recipient
ar_eg: لقد تم حظرك من قِبل هذا المستقبِل

source: The recipient is not in your contact list
ar_eg: هذا المستقبِل ليس في قائمة أسماءك

source: You are not authorized by recipient
ar_eg: ليس مُصرّحاً لك من قِبَل المُستقبِل

source: Sound recording error
ar_eg: حدث خطأ أثناء تسجيل الصوت

source: hour
ar_eg: ساعة

source: hours
ar_eg: ساعات

source: minute
ar_eg: دقيقة

source: minutes
ar_eg: دقائق

source: and
ar_eg: و

source: second
ar_eg: ثانية

source: seconds
ar_eg: ثوانٍ

source: Receiving file %s from %s.
ar_eg: جاري استقبال ملف %s من %s

source: Sending file %s to %s.
ar_eg: إرسال ملف %s إلى %s

source: File transfer %s, file %s.
ar_eg: تحويل ملف %s; ملف %s.

source: New file transfer:
ar_eg: استقبال أو إرسال ملف جديد

source: Connecting...
ar_eg: جاري الاتصال

source: Transferring...
ar_eg: جاري النقل...

source: Transferring over relay...
ar_eg: معدل النقل...

source: Waiting for accept...
ar_eg: انتظار الموافقة...

source: Paused.
ar_eg: توقف مؤقت

source: Paused remotely.
ar_eg: تم الإيقاف مؤقتاً عن بعد

source: Cancelled!
ar_eg: تم الإلغاء

source: Finished!
ar_eg: تم

source: File transfer failed.
ar_eg: تعذر تحويل الملف

source: Sender not authorized.
ar_eg: المرسِل ليس لديه تصريح.

source: Remotely cancelled.
ar_eg: تم الإلغاء عن بُعد.

source: Failed read.
ar_eg: تعذرت القراءة.

source: Failed remote read.
ar_eg: تعذرت عملية القراأة عن بُعد .

source: Failed write.
ar_eg: تعذرت الكتابة.

source: Failed remote write.
ar_eg: تعذرت عملية الكتابة عن بُعد.

source: Remote does not support file transfer.
ar_eg: التحكم عن بُعد لا يدعم إمكانية تحويل الملفات .

source: Remote offline too long.
ar_eg: انقطع التحكم عن بُعد لفترة طويلة.

source: Transferred: %.1f Mb, Speed: %.1f kb/s
ar_eg: تم تحويل: %.1f مِيجابايت, وسرعةُ التحويل الحالية هي: %.1f كيلو بايت في الثانية

source: Progress: %6.2f
ar_eg: التقدم: %6.2f

source: Time left: %d hours, %d minutes and %d seconds
ar_eg: الوقت المتبقي: %d ساعة و%d دقيقة و%d ثانية.

source: Waiting for authorization...
ar_eg: جاري انتظار التصريح...

source: Authorization refused.
ar_eg: تم رفض الترخيص

source: Error, API not available.
ar_eg: خطأ، API غير متاحة

source: %s is ready. Currently logged on user is %s.
ar_eg: %s جاهز. المستخدم الحالي لskype هو %s

source: Error! Skype attach timeout. Making retry %d of %d for 5 seconds.
ar_eg: خطأ، تعذر الاتصال بسكايب. ستتم إعادة الاتصال تلقائيا. المحاولة %d من أصل %d محاولة في خمس ثوانِ.

source: Error! Skype attach timeout. Please restart the application and try again. Exiting.
ar_eg: خطأ، تعذر الاتصال بسكايب. رجاء إغلاق البرنامج وإعادة تشغيله ثانيةً. سيتم الآن إغلاق البرنامج.

source: Sending...
ar_eg: جاري الإرسال...

source: Instant message from %s: %s
ar_eg: رسال من %s تقول: %s

source: SMS message by %s: %s
ar_eg: رسالة قصيرة من %s يقول فيها: %s

source: at %s, %s said: %s
ar_eg: في %s, %s قال: %s

source: %s at %s, %s said: %s
ar_eg: %s في %s, %s قال: %s

source: at %s, %s says: %s
ar_eg: في %s, %s يقول: %s

source: %s at %s, %s says: %s
ar_eg: %s في %s, %s يقول: %s

source: at %s: %s
ar_eg: في %s: %s

source: %s at %s: %s
ar_eg: %s في %s: %s

source: %s said: %s
ar_eg: %s قال: %s

source: %s says: %s
ar_eg: %s يقول: %s

source: Message not delivered yet.
ar_eg: لم يتم تسليم الرسالة بعد

source: Message copied to clipboard.
ar_eg: تم نَسخ محتوى الرسالة

source: copy failed
ar_eg: تعذر نَسخ الرسالة

source: opening URL
ar_eg: يتم الآن فتح الرابط

source: Failed to open this URL.
ar_eg: تَعَذَّر فتْح هذا الرابط.

source: url not found
ar_eg: لا تحتوي هذه الرسالة على روابط

source: Skype client version %s
ar_eg: إصدار برنامج skype هو %s

source: API wrapper version %s
ar_eg: API Wrapper الإصدار %s

source: No new events since you've launched %s.
ar_eg: لا توجد أي أحداث جديدة منذ فتحتَ برنامج %s.

source: No new messages since you've launched %s.
ar_eg: لا توجد رسائلً جديدة منذ فتحتَ برنامج %s.

source: There are no new file transfers yet.
ar_eg: لا يتم إرسال أو استقبال أي ملف حالياً

source: No active file transfers.
ar_eg: لا يتم استقبال أو إرسال أي ملف حاليا

source: %s, file %s
ar_eg: %s, ملف %s

source: Active File Transfers
ar_eg: الملفات التي يجري إرسالها أو استقبالها

source: Select file sender/receiver
ar_eg: تحديد مستقبل أو مرسل الملف

source: Your Skype Credit Balance is %s
ar_eg: رصيدك الحالي على skype هو: %s

source: No chat Monitor at this position, the first is at position %s.
ar_eg: لا يمكن لهذا المفتاح تنشيط أي نوافذ محادثة. أقرب نافذة محادثة يمكن تنشيطها على %s

source: Monitoring chat with %s
ar_eg: تنشيط المحادثة مع %s

source: and
ar_eg: و

source: no active chats
ar_eg: لا توجد نوافذ محادثة نشطة

source: no active chat monitor
ar_eg: لا توجد نافِذَة محادثة نشطة

source: monitor on chat with %s
ar_eg: نافذةُ المحادثة النشطة مع %s

source: No new messages since %s loaded or no chat Monitor selected yet.
ar_eg: لا توجد رسائل جديدة منذ فتح برنامج %s أو أنه لا توجد نوافذ محادثة نشطة.

source: no message at this position. The first is at position %d
ar_eg: لا توجد رسائل على هذا المفتاح. أول رسالة يمكن قراأتها على رقم %d

source: No mood text set. Press this command twice to set one.
ar_eg: لم يتم ضبط الحالة المزاجية . اضغط هذا المفتاح مرتين متتاليتين لكتابة حالة مزاجية []d]m.

source: The current mood text is: %s.
ar_eg: رسالة الحالة المزاجية الحالية هي %s

source: - Change Mood Text
ar_eg: تغيير رسالة الحالة المزاجية

source: Enter your new mood text:
ar_eg: ادخل رسالة الحالة المزاجية

source: %s has changed his/her mood text to: %s
ar_eg: %s قام بتغيير رسالة الحالة المزاجية إلى %s

source: no active call
ar_eg: تشغيل هذا الأمر أثناء المكالمات فقط

source: Not on call.
ar_eg: ليست هناك مكالمة

source: Microphone unmuted
ar_eg: الميكروفون مفتوح

source: Microphone muted
ar_eg: الميكروفون مغلق

source: call on hold
ar_eg: المكالمة في وضع الانتظار

source: call resumed
ar_eg: إستأناف المكالمة

source: No incoming or active call.
ar_eg: لا توجد أية مكالمات واردة أو نشطة.

source: %s has joined the current call.
ar_eg: %s إنضم إلى المكالمة الحالية

source: only one active call
ar_eg: مكالمة واحدة نشطة

source: Not available
ar_eg: غير متاح:

source: Audio In: %s
ar_eg: الميكروفون المستخدم %s

source: Audio Out: %s
ar_eg: جهاز إخراج الصوت المستخدم %s

source: Video In: %s
ar_eg: الكاميرا المستخدمة %s

source: Ringing device: %s
ar_eg: أداة النغمة: %s

source: There are no new calls or calls in progress. Press this command twice to call someone.
ar_eg: ليست هناك أية مكالمات جديدة أو قيد الإجراء. لبدء مكالمة جديدة اضغط هذا المفتاح مرتين متتاليتين.

source: - make call
ar_eg: إجراء مكالمة

source: Enter user's Skype name or names separated by commas:
ar_eg: أدخل اسم مستخدم سكايب. يمكنك إدخال أكثر من اسم والفصل بينهم بعلامة coma

source: There are no voicemails.
ar_eg: لا توجد أي رسائل بريد صوتي

source: Error, cannot open that voicemail.
ar_eg: خطأ، تعذر فتح رسالة البريد الصوتي هذه.

source: No voicemail to play.
ar_eg: لا توجد أي رسائل بريد صوتي للتشغيل

source: Voicemail deleted.
ar_eg: تم حذف رسالة البريد الصوتي

source: Error, voicemail cannot be deleted.
ar_eg: خطأ، تعذر حذف رسالة البريد الصوتي

source: No voicemail to delete.
ar_eg: لا توجد أي رسائل بريد صوتي للمسح

source: No voicemail at this position, the first is at position %s.
ar_eg: لا يمكن لهذا المفتاح استعراض أية رسائل بريد صوتي الآن. أقرب رسالة بريد صوتي يمكن الوصول إليها على رقم %s

source: Voicemail from %s.
ar_eg: رسالة بريد صوتي من %s

source: Voicemail to %s.
ar_eg: رسالة بريد صوتي ل%s

source: Default greeting voicemail.
ar_eg: رسالة الترحيب الافتراضية

source: Custom greeting voicemail.
ar_eg: رسالة ترحيب مخصصة

source: Unknown voicemail type.
ar_eg: رسالة بريد صوتي مجهولة النوع

source: Not played.
ar_eg: لم يتم التشغيل

source: Composing
ar_eg: كتابة رسالة

source: Delivered
ar_eg: تم الإرسال

source: SMS read
ar_eg: قراأة الرسائل القصيرة

source: SMS received
ar_eg: تم استقبال رسالة قصيرة

source: Sending Failed
ar_eg: تعذرت عملية الإرسال

source: Sending to server
ar_eg: جاري الإرسال إلى مركز الرسائل

source: Sent to server
ar_eg: تم الإرسال إلى مركز الرسائل

source: Unable to deliver to some numbers.
ar_eg: لقد تعذر الإرسال إلى بعض الأرقام.

source: Unknown
ar_eg: مجهول

source: Enter Phone Number or numbers separated by semicolons:
ar_eg: أَدخِل رقم هاتف أو أكثر ، وللفصل بين أرقام الهواتف المدخلة استخدم semicolon

source: New SMS Wizard
ar_eg: معالِج إعداد الرسائل القصيرة

source: New SMS Wizard: from %s to %s
ar_eg: معالِج إعداد الرسائل القصيرة: من %s إلى %s

source: Invalid number. Please check your input and try again.
ar_eg: الرقم الذي أدْخلْتَهُ غير صحيح. تأكد من الرقم الصحيح ثم أعِدِ المحاولة.

source: Online
ar_eg: متصل

source: Away
ar_eg: بالخارج

source: Not Available
ar_eg: غير متاح

source: Do not disturb
ar_eg: ممنوع الإزعاج

source: Invisible
ar_eg: مخفي

source: Skype Me
ar_eg: وضْع، skype me

source: Offline
ar_eg: غير متصل

source: %s's status is unknown
ar_eg: حالة الاتصال ل%s مجهولة

source: %s went Offline
ar_eg: %s: غير متصل

source: %s is Online
ar_eg: %s: متصل

source: %s is Away
ar_eg: %s: بالخارج

source: %s is Not Available
ar_eg: %s: غير متاح

source: %s is Do Not Disturb
ar_eg: %s ممنوع الإزعاج

source: %s went offline
ar_eg: %s: غير متصل

source: %s is Skype Me
ar_eg: %s: skype me

source: %s is Skype Out
ar_eg: %s: skypeout

source: Change Status
ar_eg: تغيير حالة الاتصال

source: Select status
ar_eg: تحديد حالة الاتصال

source: Changing status to %s
ar_eg: تغيير حالت الاتصال إلى %s

source: Current online status is %s
ar_eg: حالة الاتصال الحالية هي %s

source: User %s %s requests authorization. Intro text: %s
ar_eg: لقد طلب المستخدم %s %s التصريح بمشاركة سكايب، رسالة التعريف التي أرسلها: %s.

source: You are now friend with %s %s.
ar_eg: تمت إضافة %s %s إلى قائمة الأسماء.

source: User %s %s is blocked.
ar_eg: تم حظر المستخدم %s %s.

source: %s removed his/her Mood Text
ar_eg: %s حذف رسالة الحالة المزاجية الخاصة به

source: %s changed his/her Mood Text to %s
ar_eg: %s غيَّر حالته المزاجية إلى: %s

source: Status unknown.
ar_eg: حالة الاتصال مجهولة

source: Not downloaded.
ar_eg: لم يتم التنزيل

source: Downloading...
ar_eg: جاري التنزيل

source: Not played, duration %d seconds.
ar_eg: المتبقي %d ثوانِ

source: Buffering...
ar_eg: جاري التحميل

source: Playing...
ar_eg: جاري التشغيل

source: Played, duration %d seconds.
ar_eg: تم تشغيل مدة %d ثوانِ

source: Blank voicemail.
ar_eg: رسالة بريد صوتي فارغة

source: Recording...
ar_eg: جاري التسجيل

source: Recorded.
ar_eg: تم التسجيل

source: Uploading...
ar_eg: جاري الرفع

source: Uploaded.
ar_eg: تم الرفع

source: Deleting...
ar_eg: جاري الحذف

source: Voicemail error.
ar_eg: خطأ في البريد الصوتي

source: No error.
ar_eg: لا يوجد أخطاء

source: Miscellaneous error.
ar_eg: خطأ متنوع

source: Couldn't connect.
ar_eg: تعذر الاتصال

source: No voicemail privilege.
ar_eg: لا تتوافر ميزة البريد الصوتي

source: No such voicemail.
ar_eg: لا توجد رسائل بريد صوتي مماثلة

source: Couldn't read a file.
ar_eg: تعذرت قراءة الملف

source: Couldn't write a file.
ar_eg: تعذرت كتابة الملف

source: Couldn't record voicemail.
ar_eg: تعذر تسجيل رسالة البريد الصوتي

source: Couldn't play voicemail.
ar_eg: تعذر فتح رسالة البريد الصوتي

source: Skype alert
ar_eg: تحذير سكايب

source: %s (%s at %s)
ar_eg: %s (%s في %s)

source: %s (just now at %s)
ar_eg: %s الآن %s

source: No new events yet for this event type.
ar_eg: لم يتم رصد أية أحداث من هذا النوع.

source: %d seconds ago
ar_eg: منذ %d ثانية

source: a minute ago
ar_eg: منذ دقيقة واحدة

source: %d minutes ago
ar_eg: منذ %d دقيقة

source: an hour ago
ar_eg: منذ ساعة مضت

source: %d hours ago
ar_eg: منذ %d ساعة مضت

source: yesterday
ar_eg: أمس

source: %d days ago
ar_eg: منذ %d يوم

source: %d weeks ago
ar_eg: منذ %d أسبوع

source: %d months ago
ar_eg: منذ %d شهر

source: %d years ago
ar_eg: منذ %d سنة

source: An error has occured while attempting to configure autostart.
ar_eg: حدث خطأ خلال محاولة تعريف البدء التلقائي.

source: Goodbye!
ar_eg: تم إغلاق البرنامج

source: Are you sure you want to exit %s? This will also unload Skype if you've configured such behavior.
ar_eg: هل أنت متأكد من أنك تريد إغلاق %s? سيتم إغلاق skype أيضاً إذا كنت قد اخترت ذلك من الإعداداتز

source: Confirm Exit
ar_eg: تأكيد الخروج

source: About %s
ar_eg: حول %s

source: Project &Web site
ar_eg: المو&قع الرسمي للبرنامج

source: &License online
ar_eg: ا&تفاقية الترخيص على الإنترنت

source: C&ontributors
ar_eg: المسا&همين

source: User &Guide
ar_eg: &دليل المستخدم

source: &What's New
ar_eg: ال&جديد في هذه النسخة

source: Check for &updates...
ar_eg: البحث عن ت&حديثات...

source: Contacts Manager
ar_eg: قائمَت الاسماء

source: Skype Out
ar_eg: وضْع ، Skype Out:

source: Checked
ar_eg: محدد

source: Unchecked
ar_eg: غير محدد

source: &Create Conference
ar_eg: &عمل مكالمة جما&عية

source: Create multi c&hat
ar_eg: بدء محادثة &جماعية

source: &Call
ar_eg: إجراء م&كالمة

source: C&hat
ar_eg: بدء م&حادثة

source: &Contact List
ar_eg: &قائمة الأسماء

source: Contact
ar_eg: الاسم

source: Skype Name
ar_eg: الاسم على skype

source: Status
ar_eg: الحالة

source: Mood Text
ar_eg: رسالة الحالة المزاجية.

source: %s at %s
ar_eg: %s في %s

source: View &Profile...
ar_eg: عرض ال&معلومات الشخصية

source: Profile Viewer for %s (%s)
ar_eg: مستعرض المعلومات الشخصية ل%s (%s)

source: Skype name:
ar_eg: الاسم على skype:

source: Full name:
ar_eg: الاسم بالكامل:

source: Mood:
ar_eg: الحالةُ المِزاجية:

source: Birth date:
ar_eg: تاريخ الميلاد:

source: Gender:
ar_eg: الجنس:

source: Male
ar_eg: رجل

source: Female
ar_eg: أنثى

source: Language:
ar_eg: اللغة:

source: Location:
ar_eg: الموقع

source: Home phone:
ar_eg: هاتف المَنزل:

source: Office phone:
ar_eg: هاتف العمل

source: Mobile phone:
ar_eg: الهاتف النقال:

source: Home page:
ar_eg: موقع الإنترنت:

source: About me:
ar_eg: معلوماتٌ إضافيةٌ:

source: Number of contacts:
ar_eg: عددُ الأصدقاء:

source: This user is not authorized to contact me.
ar_eg: ليس مصرحاً لهذا المستخدم الاتصال بي.

source: This user is blocked.
ar_eg: تم حظر هذا المستخدم.

source: This user doesn't have a call equipment.
ar_eg: لا يتوفر لدى هذا المستخدم معدات الاتصال.

source: This user has call forwarding activated.
ar_eg: لدى هذا المستخدم خاصية إعادة توجيه المكالمات.

source: This user has a camera.
ar_eg: لدى هذا المستخدم كاميرا.

source: This user can send and receive Voice Mail.
ar_eg: يمكن لهذا المستخدم إرسال واستقبال رسائل بريد صوتي.

source: Other information:
ar_eg: معلومات أخرى.

source: Allows access to SkypeTalking Preferences Dialog where you can configure application behavior, or change your SkypeTalking language and speech output.
ar_eg: فتح محاورة التفضيلات الخاصة بskypeTalking, بغرض إجراء تعديلات على إعدادات البرنامج.

source: Opens the Contacts Manager for viewing and managing your Skype contacts on the easy way. If pressed twice, the original Skype contact list will be displayed.
ar_eg: فتح مستعرض الأسماء بغرض التحكم في وتنظيم جهات الاتصال الخاصة بك بطريقة سهلة. وإذا تم ضغطه مرتين متتاليتين، سيتم تنشيط قائمة جهات الاتصال الأساسية الخاصة ببرنامج سكايب.

source: Displays some basic information about SkypeTalking application, such as current version, copyright details and program web site.
ar_eg: لعرض بعض المعلومات الرئيسة حول برنامج skypeTalking كرقم النسخة الحالية، وحقوق النسخ، والموقع الخاص بالبرنامج.Displays some basic information about SkypeTalking application, such as current version, copyright details and program web site.

source: Quits SkypeTalking application.
ar_eg: إغلاق برنامج skypeTalking

source: Silences speech if your speech output is set to SAPI5.
ar_eg: لإسكات الصوت إذا كان النظام المستخدم للنطق هو sapi5.

source: on
ar_eg: يعمل

source: off
ar_eg: لا يعمل

source: Ignore Skype events %s.
ar_eg: تجاهل قراءة أحداث سكايب %sً

source: Toggles ignoring of all Skype events. If turned on, SkypeTalking will ignore all Skype events and will not speak nor record them.
ar_eg: تغيير حالة تجاهل الإعلان التلقائثي عن أحداث سكايب. إذا كان هذا الأمر يعمل، فسيتم تجاهل جميع الأحداث الخاصة بسكايب وعدم نطقها.

source: Key describer %s.
ar_eg: واصف مفاتيح الاختصار %s

source: Toggles on or off key describer. When turned on, it will describe a command associated with SkypeTalking keystroke being pressed.
ar_eg: لفتح وإغلاق واصف مفاتيح الاختصار. في حالة كونه مفتواحأ، سيتم نطق وظيفة كل مفتاح خاص ب skypeTalking يتم ضغطه.

source: Change the Skype online status for the current user on the fly.
ar_eg: تغيير حالة اتصال المستخدم مباشرة.

source: Checks for new versions or updates of SkypeTalking application.
ar_eg: البحث عن ما إذا كان هناك تحديثات أو نسخ جديدة لبرنامج skypeTalking.

source: Reports the current user Mood Text. If pressed twice, calls a function to change your Mood Text.
ar_eg: الإخبار برسالة الحالة المزاجية الخاصة بالمستخدم. وإذا تم ضغطه مرتين متتاليتين، سيتم فتح محاورة تتيح للمستخدم تغيير رسالة الحالة المزاجية.

source: Reports the current user online status. If pressed twice, calls a function to report the Skype credit balance for the current user.
ar_eg: للإعلان عن حالة الاتصال الحالية للمستخدم، وعند الضغط عليه مرتين متتاليتين يقوم بالإعلان عن الرصيد المتبقي لدى المستخدم في حسابه على سكايب.

source: Reports the currently running version of Skype. If pressed twice, calls a function to report an API Wrapper version, which is mainly useful for developers.
ar_eg: Reports the currently running version of Skype. If pressed twice, calls a function to report an API Wrapper version, which is mainly useful for developers.الإعلان عن نسخة سكايب الحالية. وإذا تم ضغطه مرتين متتاليتين، سيتم استدعاء أداة تسمى API rapper خاصة بالمبرمجين.

source: Repeats the last Skype event that happened during the SkypeTalking session.
ar_eg: لنطق آخر حدث تم رصده منذ فتح برنامج skypeTalking.

source: Reports the status of the last incoming or outgoing file transfer. If pressed twice, allows you to choose one of the active file transfers to monitor.
ar_eg: للإعلان عن حالة الملف الذي يتم استقباله أو إرساله. وفي حالة ضغطه مرتين متتاليتين، سيتم فتح محاورة تسمح لك باختيار الملف الذي تريد متابعته.

source: Reports duration of an active call in hours/minutes/seconds.
ar_eg: لنطق مدة المكالمة النشطة.

source: Reports the status of an active call. If pressed twice, will open a dialog box allowing you to call someone by entering the Skype name of a user, or multiple users separated by commas to create a conference.
ar_eg: للإعلان عن حالة المكالمة الحالية. أما إذا تم ضغطه مرتين متتاليتين، فسيتم فتح محاورة تتيح لك الاتصال بأي شخص على سكايب عن طريق كتابة اسمه في مربع تحرير. يمكنك أيضا الاتصال بأكثر من شخص عن طريق فصل أسماء المستخدمين بعلامة comma, وذلك بغرض عمل مكالمة جماعية.

source: Launches a wizard for sending SMS messages on the easy way via SkypeTalking.
ar_eg: لتشغيل معالج يمكنك من إرسال رسائل قصيرة بطريقة سهلة عن طريق skypetalking.

source: Go to next event in the events history buffer.
ar_eg: للذهاب إلى الحدث التالي في مستعرض سجل الأحداث.

source: Go to previous event in the events history buffer.
ar_eg: للانتقال إلى الحدث السابق في مستعرض سجل الأحداث.

source: calls
ar_eg: المكالمات

source: messages
ar_eg: الرسائل

source: file transfers
ar_eg: الملفات التي يتم إرسالها أو استقبالها

source: user actions
ar_eg: أفعال المستخدم

source: voicemail
ar_eg: رسالة بريد صوتي

source: status changes
ar_eg: تغييرات حالة الاتصال

source: Selects the event type to view in the events history buffer between status changes, calls, messages, file transfers, or user actions.
ar_eg: لتحديد نوع الأحداث التي يتم عرضها في مستعرض سجل الأحداث. حيث يتم التغيير بين تغييرات رسائل الحالة المزاجية والمكالمات والمحادثات والملفات المرسلة والمستقبلة وأفعال المستخدم.

source: Selects chat monitor. If pressed twice, opens a chat window of the chat currently being monitored.
ar_eg: لتحديد نافذة المحادثة النشطة، وفي حالة ضغطه مرتين متتاليتين، ستُفتح نافذة المحادثة النشطة.

source: Reports the current chat monitor. If pressed twice, opens the Skype chat window for the chat currently being monitored.
ar_eg: للإعلان عن نافذة المحادثة النشطة حاليا. في حالة ضغط هذا المفتاح مرتين متتاليتين سيتم فتح نافذة المحادثة النشطة.

source: Review one of the last 10 items depending on selected review mode. Press it twice or thrice to execute the 2nd or 3rd action for the item (if possible).
ar_eg: يقوم باستعراض أحد العشرة عناصر الأخيرة بحسب وضع الاستعراض النشط، رسائل البريد الصوتي أو رسائل المحادثة. وفي حالة الضغط مرتين متتاليتين أو ثلاثة مرات متتالية سيقوم بتنفيذ الأمر الثاني أو الثالث للعنصر إذا كان متاحا.

source: Voicemail mode
ar_eg: وضع رسائل البريد الإلكتروني.

source: Message mode
ar_eg: وضع رسائل المحادثة

source: Toggles between Message mode or Voicemail mode.
ar_eg: التنقل بين وضعي رسائل البريد الصوتي ورسائل المحادثة.

source: Repeats the last incoming or outgoing chat message. If pressed twice, opens the Skype chat window associated with that message and sets chat monitor to it.
ar_eg: لنطق آخر رسالة محادثة صادرة أو واردة، وإذا تم ضغطه مرتين متتاليتين، سيقوم بفتح نافذة المحادثة وتنشيطها.

source: Answers the call, or toggles between hold and resume for calls in progress.
ar_eg: للرد على المكالمة الواردة، أو لالتنقل بين وضع المكالمة على الانتظار واستئنافها مرة أخرى بالنسبة للمكالمة الجارية.

source: Answers the call and joins it to a conference (if on a conference call).
ar_eg: الرد على المكالمة ودمجها مع المكالمة الحالية.

source: Ends the call or stops recording voicemail.
ar_eg: لإنهاء المكالمة أو إيقاف تسجيل رسالة بريد صوتي.

source: Mutes or unmutes microphone depending on it's current state.
ar_eg: يقوم بكتم وتشغيل الميكروفون بحسب حالته الحالية.
