Repository: Dindows-Systems/Skype-Examples
Catalog: SkypeTalking_0.9.6_SRC/SkypeTalking/src/locale/*/LC_MESSAGES/SkypeTalking.po
Languages: ar_eg

source: Reports currently used input/output devices.
ar_eg: يستخدم للإعلان عن أدوات الإدخال والإخراج المستخدمة حالياً.

source: Reports the status of the last voicemail. If pressed twice, opens and plays the voicemail. If pressed thrice, deletes the voicemail.
ar_eg: يعلن عن حالة رسالة البريد الصوتي الأخيرة. وإذا تم ضغطه مرتين متتاليتين سيتم فتح وتشغيل الرسالة، وإذا تم ضغطه ثلاثة مرات متتالية سيتم مسحها تماما.

source: No description
ar_eg: لا يوجد وصف

source: Preferences
ar_eg: التفضيلات

source: Number of &connection retries before giving up:
ar_eg: عدد محاولات إعادة الا&تصال قبل الإلغاء

source: Start Skype &minimized
ar_eg: بدء نافذة سكايب م&صغّرة عند تشغيله.

source: No &splash screen when starting Skype
ar_eg: عدم عرض شاشة منقطة مع بدء سكايب

source: User changed his/her Mood &Text
ar_eg: الإعلان عن قيام أحد المستخدمين بتغيير رسالة الحالة المزاجية

source: Chat message &received
ar_eg: القراءة التلقائية لرسائل المحادثة التي يتم ا&ستقبالها

source: Chat message &sent
ar_eg: القراءة التلقائية لرسائل المحادثة التي يتم إ&رسالها

source: Online status &unknown
ar_eg: التنبيه عندما تكون حالت الاتصال &مجهولة

source: Online status O&ffline
ar_eg: التنبيه عندما تكون حالت الاتصال &غير متصل

source: Online status &Online
ar_eg: التنبيه عندما تكون حالت الاتصال &متصل

source: Online status &Away
ar_eg: التنبيه عندما تكون حالة الاتصال &بالخارج

source: Online status &Not Available
ar_eg: التنبيه عندما تكون حالت الاتصال &غير متاح

source: Online status &Do Not Disturb
ar_eg: التنبيه عندما تكون حالت الاتصال &ممنوع الإزعاج

source: Online status &Invisible
ar_eg: التنبيه عندما تكون حالت الاتصال &مخفي

source: Online status &SkypeOut
ar_eg: التنبيه عندما تكون حالت الاتصال &SkypeOut

source: Online status &Skype Me!
ar_eg: التنبيه عندما تكون حالت الاتصال &skype me!

source: Show &offline contacts
ar_eg: عرض الأسماء غير المت&صلة

source: &Language:
ar_eg: &اللغة

source: Start %s with &Windows
ar_eg: ت&شغيل %s مع بداية ويندوز

source: Automatically &start Skype with %s
ar_eg: تشغيل سكايب تلقائيا عند تشغيل %s

source: Automatically &close Skype when %s exits
ar_eg: إغلاق سكايب تلقائياً عند إغلاق %s

source: C&onfirm when exiting %s
ar_eg: التنبيه قبل إ&غلاق برنامج %s

source: Show %s icon on the &taskbar
ar_eg: عرض أيكونة %s في &شريط المهام

source: &Keystrokes
ar_eg: مفاتيح الا&ختصار

source: Function
ar_eg: الوظيفة

source: Keystroke
ar_eg: مفتاح الاختصار

source: Description
ar_eg: الوصف

source: &Change...
ar_eg: ت&غيير

source: Change keystroke for %s
ar_eg: تغيير مفتاح الاختصار الخاص ب%s

source: Modifiers
ar_eg: مفاتيح التعديل

source: &Key:
ar_eg: الم&فتاح

source: %s keystroke already in use. Please try another one.
ar_eg: مفتاح الاختصار %s مستخدَم بالفعل. رجاءاً اختر مفتاح اختصار آخر.

source: Change Keystroke Error
ar_eg: خطأ في تغيير مفتاح الاختصار

source: Speech Output:
ar_eg: النطق عن طريق

source: Auto detect
ar_eg: اكتشاف قارئ الشاشة تلقائيا

source: SAPI5
ar_eg: سابي5 (SAPI5)

source: SAPI5 Speech Rate:
ar_eg: سُرْعَةُ قراأة sapi5

source: SAPI5 Volume:
ar_eg: مستوى صوت sapi5

source: Enable &braille output
ar_eg: تفعيل &مخرج طريقة برايل

source: &Automatically check for %s updates
ar_eg: البحث التلقائي عن تحديثات %s

source: &Download Type:
ar_eg: نوع الملف الذي سيتم تن&زيله

source: Installer
ar_eg: ملف تنصيب عادي

source: Portable Archive
ar_eg: نسخة مضغوطة بوقتابل لليو إس بي

source: Speak message &time
ar_eg: قراءة وقت إرسال الرسالة

source: Speak contact &name with message
ar_eg: قراءة اسم المرسِل مع ال&رسالة

source: After the alert
ar_eg: بعد الرسالة

source: Before the alert
ar_eg: قبل الرسالة

source: Never
ar_eg: لا تنطق إطلاقا

source: Say "Skype Alert" message
ar_eg: نطق كلمة skype مع الرسائل

source: General
ar_eg: عام

source: Output
ar_eg: المخرجات

source: Alerts
ar_eg: التنبيهات

source: Verbosity
ar_eg: الإطناب

source: Advanced
ar_eg: متقدم

source: Updates
ar_eg: التحديثات

source: Hot keys
ar_eg: مفاتيح الاختصار

source: Settings saved.
ar_eg: تم حفظ الإعدادات

source: Settings applied.
ar_eg: تم حفظ الإعدادات

source: Settings canceled.
ar_eg: لم يتم حفظ الإعدادات

source: Error in %s language file
ar_eg: خطأ في %s ملف اللغة

source: Language Error
ar_eg: خطأ في اللغة

source: Message text:
ar_eg: محتوى الرسالة:

source: &Send
ar_eg: &اَرْسِلْ

source: SMS sending failed.
ar_eg: تعذّرَ إرسال الرسالة القصيرة.

source: SMS %d, %d characters left, Current price %s.
ar_eg: الرسالة القصيرة %d. عدد الأحرف المتبقية %d, السعر الحالي %s

source: Empty
ar_eg: فارغ

source: &Contacts Manager...
ar_eg: قائمَت الأ&سماء

source: Open Contacts Manager
ar_eg: فتح قائمَت الاسماء

source: &Send SMS Wizard...
ar_eg: &معالِج إعداد الرسائل القصيرة

source: Start SMS Send Wizard
ar_eg: بدء معالِج إعداد الرسائل القصيرة

source: &Preferences...
ar_eg: ال&تفضيلات

source: Open Preferences Dialog
ar_eg: فتح محاورة التفضيلات

source: &Tools
ar_eg: الأد&وات

source: &User Guide
ar_eg: &دليل المستخدم

source: Read User Guide
ar_eg: قراءة دليل المستخدم

source: Read What's New
ar_eg: قراءة الجديد في هذه النسخة

source: &Contributors
ar_eg: أسماء المسا&همين

source: View Contributors List
ar_eg: عرض قائمة أسماء المساهمين.

source: &License
ar_eg: ال&ترخيص

source: View the license
ar_eg: عرض الترخيص

source: %s on the &Web
ar_eg: %s على الإ&نترنت

source: Launch project Web Site in default browser
ar_eg: تشغيل موقع المشروع على الإنترنت في المتصفح الافتراضي.

source: Check for the latest application updates
ar_eg: البحث عن تحديثات للبرنامج.

source: &About %s...
ar_eg: &حول %s

source: &Help
ar_eg: م&ساعدة

source: E&xit
ar_eg: إ&غلاق

source: Exit %s
ar_eg: إغلاق %s

source: New version available
ar_eg: تم اكتشاف نسخة جديدة متاحة للتحميل.

source: Your version: %s. Latest version: %s. Do you wish to download the latest version of %s?
ar_eg: النسخة الحالية: %s .النسخة الأحدث: %s. هل ترغب في تنزيل النسخة الأحدث من %s؟

source: Update cancelled.
ar_eg: تم إلغاء عملية التحديث.

source: Accessing download URL... Please wait...
ar_eg: جاري الآن الوصول إلى رابط التنزيل. يُرجى الانتظار.

source: Downloading update... Please wait...
ar_eg: جاري الآن تنزيل التحديث. يُرجى الانتظار.

source: Update ready! Choose Ok to continue.
ar_eg: التحديث جاهز. الرجاء ضغط موافق للمتابعة.

source: Download completed
ar_eg: تمت عملية التنزيل بنجاح

source: Update ready to install! Choose Ok to exit %s and launch the update installation program.
ar_eg: التحديث جاهز للتنصيب الآن. الرجاء ضغط زر موافق لإغلاق %s وبدء عملية التنصيب.

source: Unable to get online version number, probably due to a lost connection or network maintenance. Please check your connection or try again later.
ar_eg: تعذر الوصول إلى رقم النسخة المتاحة على الإنترنت. قد يكون ذلك بسبب انقطاع في الاتصال، أو بسبب بعض عمليات الصيانة للشبكة.ّ

source: Update error
ar_eg: خطأ في عملية التحديث

source: Unable to find online version number. It may be due to a website temporarily unavailable or it's content being modified. Please try again later.
ar_eg: تعذر العثور على رقم النسخة المتاحة على الموقع. قد يكون الموقع غير متاح مؤقتاً أو ربما يتم تعديل محتوياته حاليا. الرجاء المحاولة لاحقا

source: Couldn't access download URL. Please try again later.
ar_eg: تعذر الوصول إلى رابط التنزيل. الرجاء المحاولة مرة أخرى.

source: Download failed!
ar_eg: تعذرت عملية التنزيل

source: Your version of %s is up-to-date. Updating is not necessary. Current version: %s. Online version: %s.
ar_eg: النسخة الحالية من %s لا تحتاج إلى تحديث. النسخة الحالية: %s. النسخة المتاحة على الموقع: %s

source: Checking for updates... Please wait...
ar_eg: جاري البحث عن تحديثات. يُرجى الانتظار.
